cmsis-svd/cmsis-svd/data/Microchip/ATSAMR34.svd
        <register>
          <dim>8</dim>
          <dimIncrement>0x20</dimIncrement>
          <name>PSTATUSCLR%s</name>
          <description>HOST End Point Pipe Status Clear</description>
          <addressOffset>0x104</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DTGL</name>
              <description>Data Toggle clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CURBK</name>
              <description>Curren Bank clear</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PFREEZE</name>
              <description>Pipe Freeze Clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BK0RDY</name>
              <description>Bank 0 Ready Clear</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BK1RDY</name>
              <description>Bank 1 Ready Clear</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x20</dimIncrement>
          <name>PSTATUSSET%s</name>
          <description>HOST End Point Pipe Status Set</description>
          <addressOffset>0x105</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DTGL</name>
              <description>Data Toggle Set</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CURBK</name>
              <description>Current Bank Set</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PFREEZE</name>
              <description>Pipe Freeze Set</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BK0RDY</name>
              <description>Bank 0 Ready Set</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BK1RDY</name>
              <description>Bank 1 Ready Set</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x20</dimIncrement>
          <name>PSTATUS%s</name>
          <description>HOST End Point Pipe Status</description>
          <addressOffset>0x106</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>DTGL</name>
              <description>Data Toggle</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CURBK</name>
              <description>Current Bank</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PFREEZE</name>
              <description>Pipe Freeze</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BK0RDY</name>
              <description>Bank 0 ready</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BK1RDY</name>
              <description>Bank 1 ready</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x20</dimIncrement>
          <name>PINTFLAG%s</name>
          <description>HOST Pipe Interrupt Flag</description>
          <addressOffset>0x107</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>TRCPT0</name>
              <description>Transfer Complete 0 Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRCPT1</name>
              <description>Transfer Complete 1 Interrupt Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRFAIL</name>
              <description>Error Flow Interrupt Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PERR</name>
              <description>Pipe Error Interrupt Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXSTP</name>
              <description>Transmit  Setup Interrupt Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STALL</name>
              <description>Stall Interrupt Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x20</dimIncrement>
          <name>PINTENCLR%s</name>
          <description>HOST Pipe Interrupt Flag Clear</description>
          <addressOffset>0x108</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>TRCPT0</name>
              <description>Transfer Complete 0 Disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRCPT1</name>
              <description>Transfer Complete 1 Disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRFAIL</name>
              <description>Error Flow Interrupt Disable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PERR</name>
              <description>Pipe Error Interrupt Disable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXSTP</name>
              <description>Transmit Setup Interrupt Disable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STALL</name>
              <description>Stall Inetrrupt Disable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x20</dimIncrement>
          <name>PINTENSET%s</name>
          <description>HOST Pipe Interrupt Flag Set</description>
          <addressOffset>0x109</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>TRCPT0</name>
              <description>Transfer Complete 0 Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRCPT1</name>
              <description>Transfer Complete 1 Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRFAIL</name>
              <description>Error Flow Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PERR</name>
              <description>Pipe Error Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXSTP</name>
              <description>Transmit  Setup Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STALL</name>
              <description>Stall Interrupt Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
       </cluster> <!-- UsbHost -->
      </registers>
    </peripheral>
    <peripheral>
      <name>WDT</name>
      <version>1.0.1</version>
      <description>Watchdog Timer</description>
      <groupName>WDT</groupName>
      <prependToName>WDT_</prependToName>
      <baseAddress>0x40001C00</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>WDT</name>
        <value>1</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRLA</name>
          <description>Control</description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WEN</name>
              <description>Watchdog Timer Window Mode Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ALWAYSON</name>
              <description>Always-On</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG</name>
          <description>Configuration</description>
          <addressOffset>0x1</addressOffset>
          <size>8</size>
          <resetValue>0xBB</resetValue>
          <fields>
            <field>
              <name>PER</name>
              <description>Time-Out Period</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>PERSelect</name>
                <enumeratedValue>
                  <name>CYC8</name>
                  <description>8 clock cycles</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYC16</name>
                  <description>16 clock cycles</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYC32</name>
                  <description>32 clock cycles</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYC64</name>
                  <description>64 clock cycles</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYC128</name>
                  <description>128 clock cycles</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYC256</name>
                  <description>256 clock cycles</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYC512</name>
                  <description>512 clock cycles</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYC1024</name>
                  <description>1024 clock cycles</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYC2048</name>
                  <description>2048 clock cycles</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYC4096</name>
                  <description>4096 clock cycles</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYC8192</name>
                  <description>8192 clock cycles</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYC16384</name>
                  <description>16384 clock cycles</description>
                  <value>0xb</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WINDOW</name>
              <description>Window Mode Time-Out Period</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>WINDOWSelect</name>
                <enumeratedValue>
                  <name>CYC8</name>
                  <description>8 clock cycles</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYC16</name>
                  <description>16 clock cycles</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYC32</name>
                  <description>32 clock cycles</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYC64</name>
                  <description>64 clock cycles</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYC128</name>
                  <description>128 clock cycles</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYC256</name>
                  <description>256 clock cycles</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYC512</name>
                  <description>512 clock cycles</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYC1024</name>
                  <description>1024 clock cycles</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYC2048</name>
                  <description>2048 clock cycles</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYC4096</name>
                  <description>4096 clock cycles</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYC8192</name>
                  <description>8192 clock cycles</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYC16384</name>
                  <description>16384 clock cycles</description>
                  <value>0xb</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EWCTRL</name>
          <description>Early Warning Interrupt Control</description>
          <addressOffset>0x2</addressOffset>
          <size>8</size>
          <resetValue>0x0B</resetValue>
          <fields>
            <field>
              <name>EWOFFSET</name>
              <description>Early Warning Interrupt Time Offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>EWOFFSETSelect</name>
                <enumeratedValue>
                  <name>CYC8</name>
                  <description>8 clock cycles</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYC16</name>
                  <description>16 clock cycles</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYC32</name>
                  <description>32 clock cycles</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYC64</name>
                  <description>64 clock cycles</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYC128</name>
                  <description>128 clock cycles</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYC256</name>
                  <description>256 clock cycles</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYC512</name>
                  <description>512 clock cycles</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYC1024</name>
                  <description>1024 clock cycles</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYC2048</name>
                  <description>2048 clock cycles</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYC4096</name>
                  <description>4096 clock cycles</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYC8192</name>
                  <description>8192 clock cycles</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYC16384</name>
                  <description>16384 clock cycles</description>
                  <value>0xb</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Interrupt Enable Clear</description>
          <addressOffset>0x4</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>EW</name>
              <description>Early Warning Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>Interrupt Enable Set</description>
          <addressOffset>0x5</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>EW</name>
              <description>Early Warning Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAG</name>
          <description>Interrupt Flag Status and Clear</description>
          <addressOffset>0x6</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>EW</name>
              <description>Early Warning</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNCBUSY</name>
          <description>Synchronization Busy</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable Busy</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WEN</name>
              <description>Window Enable Busy</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ALWAYSON</name>
              <description>Always-On Busy</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLEAR</name>
              <description>Clear Busy</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLEAR</name>
          <description>Clear</description>
          <addressOffset>0xC</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CLEAR</name>
              <description>Watchdog Clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <name>CLEARSelect</name>
                <enumeratedValue>
                  <name>KEY</name>
                  <description>Clear Key</description>
                  <value>0xa5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>
